package com.javarush.task.task08.task0827;

import java.text.ParseException;
import java.text.SimpleDateFormat;
import java.util.Date;
import java.util.Locale;

/* 
Работа с датой
1. Реализовать метод isDateOdd(String date) так, чтобы он возвращал true,
если количество дней с начала года — нечетное число, иначе false
2. String date передается в формате MAY 1 2013
Не забудьте учесть первый день года.

Пример:
JANUARY 1 2000 = true
JANUARY 2 2020 = false


Требования:
1. Программа должна выводить текст на экран.
2. Класс Solution должен содержать два метода.
3. Метод isDateOdd() должен возвращать true, если количество дней с начала года - нечетное число, иначе false.
4. Метод main() должен вызывать метод isDateOdd().
*/

public class Solution {
    public static void main(String[] args) throws ParseException {
        System.out.println(isDateOdd("MAY 1 2013"));
    }

    public static boolean isDateOdd(String date) throws ParseException {
            SimpleDateFormat formater = new SimpleDateFormat("MMM d yyyy", Locale.US);
            Date givenDate = formater.parse(date);
            Date yearStart = new Date(givenDate.getYear(), 0, 0);
            long interval = givenDate.getTime() - yearStart.getTime();

            int dayCounter = (int) (interval/(24*60*60*1000));
            if ((dayCounter % 2) == 1){
                return true;
            }
            else return false;
    }
}
